# '''Перед вами 10 программ. 
# Ответьте какими типами данных будет обладать переменная x,
#  в конце каждой программы:''''
#1

#1
#x = str(int(float(5))) #целое чис
#2
# x = 'aa' == 'AA' #строки
# print(x)
#3
#x = {i: i**2 for i in range(5)}# цыклы

#4
#  x = set(list((5, 6, 7)))#Тип данных
# #5
#  a = {1: 1, 2: 4, 3: 9} #массивы
#  x = a.get(4)
# #6
# x = [].append('j')#добавления чего либо в список
# #7
# for i in range(10):
# 		if i < 5:
# 				x = 'hello'#функции и модули
# 		else:
# 				x = 5
# #8
# x = input('Enter and integer: 5 ')
# print(x) #Тип данных
# #9
#  a = 5
#  b = [1, 3, 5, ]
#  x = 'x'
#  a, b, x = x, a, b #Тип данных
# #10
# def func(x, y=5):
# 		return x + y
# x = func('Jaguar ', 'hunter')#списки
